In [26]:
import pandas as pd
df = pd.read_csv("data.csv")

In [27]:
df.describe()

                id    tax
count  1000.000000  654.0
mean    500.500000   20.0
std     288.819436    0.0
min       1.000000   20.0
25%     250.750000   20.0
50%     500.500000   20.0
75%     750.250000   20.0
max    1000.000000   20.0

In [28]:
df["price_paid"].describe()

count      1000
unique      528
top       $3.73
freq          8
Name: price_paid, dtype: object

In [29]:
df.price_paid = df.price_paid.apply(lambda x: x.replace("$", ""))
df.price_paid = df.price_paid.astype(float)

In [30]:
df["price_paid"].mean()

6.461930000000001

In [31]:
df["price_paid"].sum()

6461.93

In [32]:
df["price_paid"].min()

3.0

In [33]:
df["price_paid"].max()

10.0

In [34]:
df["country"].unique().tolist()

['Canada', 'United States', 'Morocco', 'France', nan]

In [35]:
df["country"].value_counts()

France           408
United States    333
Canada           161
Morocco           54
Name: country, dtype: int64

In [36]:
df["gender"].value_counts(normalize=True)

Female    0.529538
Male      0.470462
Name: gender, dtype: float64

In [37]:
df.groupby("country").mean()

                       id  price_paid   tax
country
Canada         437.049689    6.319565  20.0
France         525.588235    6.420613  20.0
Morocco        492.425926    6.721667  20.0
United States  504.954955    6.557568  20.0

In [38]:
df.groupby("gender")["price_paid"].sum()

gender
Female    3165.26
Male      2833.61
Name: price_paid, dtype: float64

In [40]:
df.groupby(["gender", "country"]).mean()

                              id  price_paid   tax
gender country
Female Canada         461.472973    6.419324  20.0
       France         512.648241    6.350352  20.0
       Morocco        479.925926    7.024815  20.0
       United States  487.282353    6.437118  20.0
Male   Canada         406.000000    6.117467  20.0
       France         534.928177    6.498950  20.0
       Morocco        483.652174    6.146957  20.0
       United States  525.284722    6.672500  20.0